meeTeam05/datalogger/firmware/STM32/Datalogger_Lib/src/cmd_parser.c
/**
 * @file cmd_parser.c
 *
 * @brief Command Parser Implementations
 */

/* INCLUDES ------------------------------------------------------------------*/

#include <stdlib.h>
#include <string.h>
#include "cmd_parser.h"
#include "ds3231.h"
#include "data_manager.h"
#include "print_cli.h"
#include "sht3x.h"
#include "stm32f1xx_hal.h" // For HAL_Delay and HAL_GetTick

/* DEFINES -------------------------------------------------------------------*/

#define SHT3X_MODE_REPEAT_DEFAULT SHT3X_HIGH
#define SHT3X_MODE_PERIODIC_DEFAULT SHT3X_PERIODIC_1MPS

/* PUBLIC API ----------------------------------------------------------------*/

void SHT3X_Heater_Parser(uint8_t argc, char **argv)
{
	if (argc == 3 && strcmp(argv[2], "ENABLE") == 0)
	{
		sht3x_heater_mode_t modeHeater = SHT3X_HEATER_ENABLE;
		if (SHT3X_Heater(&g_sht3x, &modeHeater) == SHT3X_OK)
		{
			PRINT_CLI("SHT3X HEATER ENABLE SUCCEEDED\r\n");
		}
		else
		{
			PRINT_CLI("SHT3X HEATER ENABLE FAILED\r\n");
		}
	}

	else if (argc == 3 && strcmp(argv[2], "DISABLE") == 0)
	{
		sht3x_heater_mode_t modeHeater = SHT3X_HEATER_DISABLE;
		if (SHT3X_Heater(&g_sht3x, &modeHeater) == SHT3X_OK)
		{
			PRINT_CLI("SHT3X HEATER DISABLE SUCCEEDED\r\n");
		}
		else
		{
			PRINT_CLI("SHT3X HEATER DISABLE FAILED\r\n");
		}
	}
}

void SHT3X_ART_Parser(uint8_t argc, char **argv)
{
	if (SHT3X_ART(&g_sht3x) == SHT3X_OK)
	{
		PRINT_CLI("SHT3X ART MODE SUCCEEDED\r\n");
	}
	else
	{
		PRINT_CLI("SHT3X ART MODE FAILED\r\n");
	}
}

void DS3231_Set_Time_Parser(uint8_t argc, char **argv)
{
	if (argc != 10)
	{
		PRINT_CLI("DS3231 SET TIME <WEEKDAY> <DAY> <MONTH> <YEAR> <HOUR> <MIN> <SEC>\r\n");
		return;
	}

	uint8_t weekday = (uint8_t)atoi(argv[3]);
	uint8_t day = (uint8_t)atoi(argv[4]);
	uint8_t month = (uint8_t)atoi(argv[5]);
	uint16_t year = (uint16_t)atoi(argv[6]);
	uint8_t hour = (uint8_t)atoi(argv[7]);
	uint8_t min = (uint8_t)atoi(argv[8]);
	uint8_t sec = (uint8_t)atoi(argv[9]);

	// Validate parameters
	if (year < 0 || year > 99 || month < 1 || month > 12 || day < 1 || day > 31 || weekday < 1 ||
		weekday > 7 || hour < 0 || hour > 23 || min < 0 || min > 59 || sec < 0 || sec > 59)
	{
		PRINT_CLI("DS3231 INVALID PARAMETER VALUES\r\n");
		return;
	}

	// Create struct tm and populate it
	struct tm time;
	time.tm_sec = sec;
	time.tm_min = min;
	time.tm_hour = hour;
	time.tm_mday = day;
	time.tm_mon = month - 1;	// tm_mon is 0-11
	time.tm_year = year + 100;	// tm_year is years since 1900
	time.tm_wday = weekday - 1; // tm_wday is 0-6 (Sunday = 0)

	// Call DS3231_Set_Time with struct tm pointer
	HAL_StatusTypeDef status = DS3231_Set_Time(&g_ds3231, &time);

	if (status == HAL_OK)
	{
		PRINT_CLI("DS3231 TIME SET: 20%02d-%02d-%02d %02d:%02d:%02d (WD:%d)\r\n",
				  year, month, day, hour, min, sec, weekday);
	}
	else
	{
		PRINT_CLI("DS3231 FAILED TO SET TIME\r\n");
	}
}

void SINGLE_PARSER(uint8_t argc, char **argv)
{
	if (argc != 1)
	{
		return;
	}

	float temp = 0.0f, hum = 0.0f;
	sht3x_repeat_t repeat = SHT3X_MODE_REPEAT_DEFAULT; // Create variable for pointer

	// Read sensor data in single-shot mode
	SHT3X_StatusTypeDef status = SHT3X_Single(&g_sht3x, &repeat, &temp, &hum);

	// Update data manager with measurement (0.0 if sensor failed)
	if (status == SHT3X_OK)
	{
		DataManager_UpdateSingle(temp, hum);
	}
	else
	{
		// Sensor read failed, report 0.0 values
		DataManager_UpdateSingle(0.0f, 0.0f);
	}
}

void PERIODIC_ON_PARSER(uint8_t argc, char **argv)
{
	if (argc != 2)
	{
		return;
	}

	float temp = 0.0f, hum = 0.0f;

	sht3x_mode_t mode = SHT3X_MODE_PERIODIC_DEFAULT;
	sht3x_repeat_t repeat = SHT3X_MODE_REPEAT_DEFAULT;

	// Start periodic mode on sensor
	SHT3X_StatusTypeDef status = SHT3X_Periodic(&g_sht3x, &mode, &repeat, &temp, &hum);

	// Update data manager with first measurement
	if (status == SHT3X_OK)
	{
		DataManager_UpdatePeriodic(temp, hum);
	}
	else
	{
		// Sensor failed to start, report 0.0 values
		DataManager_UpdatePeriodic(0.0f, 0.0f);
	}

	// Schedule next fetch regardless of sensor status
	next_fetch_ms = HAL_GetTick() + periodic_interval_ms;
}

void PERIODIC_OFF_PARSER(uint8_t argc, char **argv)
{
	if (argc != 2)
	{
		return;
	}

	SHT3X_Stop_Periodic(&g_sht3x);
}

void SET_TIME_PARSER(uint8_t argc, char **argv)
{
    // SET TIME <unix_timestamp>
    if (argc != 3)
    {
        return;
    }

    // Parse Unix timestamp
    time_t timestamp = (time_t)atol(argv[2]);

    // Convert to struct tm
    struct tm *time = localtime(&timestamp);

    if (time == NULL)
    {
        return;
    }

    // Call DS3231_Set_Time with struct tm pointer
    DS3231_Set_Time(&g_ds3231, time);
}

void SET_PERIODIC_INTERVAL_PARSER(uint8_t argc, char **argv)
{
	// SET PERIODIC INTERVAL <SECONDS>
	uint32_t interval;
	
	if (argc != 4)
	{
		return;
	}
	interval = (uint32_t)atoi(argv[3]);

	// Validate interval (minimum 1 second)
	periodic_interval_ms = interval * 1000; // Convert seconds to milliseconds
}
